{
    "uiparameters": {
        "isfsm": {
            "type": "boolean",
            "default": true,
            "description": "True if the graph represents a Finite State Machine, in which case it can contain an incoming edge from nowhere (the start edge) and can have 'accept' nodes"
        },
        "isdirected": {
            "type": "boolean",
            "default": true,
            "description": "True if edges are directed"
        },
        "noderadius": {
            "type": "int",
            "default": 26,
            "description": "The radius of a node in pixels"
        },
        "fontsize": {
            "type": "int",
            "default": 20,
            "description": "The font size in points used for node and edge labels."
        },
        "helpmenutext": {
            "type": "string",
            "default": "",
            "description": "Text which if non-empty replaces the standard help menu text defined in the CodeRunner language strings"
        },
        "textoffset": {
            "type": "int",
            "default": 5,
            "description": "The offset in pixels of a link label from its link"
        },
        "locknodepositions": {
            "type": "boolean",
            "default": false,
            "description": "If true, prevents the user from moving nodes. Useful when the answer box is preloaded with a graph that the student has to annotate by changing node or edge labels or by adding/removing edges. Note, though that nodes can still be added and deleted. See locknodeset."
        },
        "locknodeset": {
            "type": "boolean",
            "default": false,
            "description": "If true, prevents the the user from adding or deleting nodes or toggling node types to/from acceptors."
        },
        "locknodelabels": {
            "type": "boolean",
            "default": false,
            "description": "If true, prevent the user from editing node labels. This will also prevent any new nodes having non-empty labels"
        },
        "lockedgepositions": {
            "type": "boolean",
            "default": false,
            "description": "If true prevents the user from dragging edges to change their curvature. Possibly useful if the answer box is preloaded with a graph that the student has to annotate by changing node or edge labels or by adding/removing edges. Also ensures that edges added by a student are straight, e.g. to draw a polygon on a set of given points. Note, though that edges can still be added and deleted. See lockedgeset."
        },
        "lockedgeset": {
            "type": "boolean",
            "default": false,
            "description": "If true prevents the user from adding or deleting edges."
        },
        "lockedgelabels": {
            "type": "boolean", 
            "default": false,
            "description": "True to prevent the user from editing edge labels. This also prevents any new edges from having labels."
        }
    }
}
